src/redis数据结构.org
下面为redis支持的数据结构：
1. strings
2. lists: strings元素的集合，顺序为插入的顺序
3. sets: strings元素的集合，但唯一且没有顺序
4. sorted sets: 可排序的sets，根据'score'排序
5. hash: 和ruby的hash一样
6. bit数组: 暂时不知道
7. HyperLogLogs: ...

** Redis Keys
   
   Redis Keys是binary safe的，所以可以使用任意二进制流，比如'foo'或者jpg图片，空字符串也是一种key。选择key需要注意以下几点：
   1. 不要使用太长的key，因为会影响查询速度；占用更多内存空间。
   2. 不要用太短的key，比如'user:1000:followers'非要写成'u:1000:flw'我的天，影响可读性。
   3. key的名字尽量表示schema，比如'user:222'，多字符可以用'.'或者'-'来分割，比如'comment:123:reply-to'
   #+BEGIN_QUOTE
   和SQL数据库相比，NoSQL数据库感觉就是把SQL的table和column按照特定规则组合成string，放到NoSQL的key中
   #+END_QUOTE
   4. key size最大值为512MB
   #+BEGIN_QUOTE
   鬼能超过-_-
   #+END_QUOTE
   
** Redis Strings

   Redis Strings的类型和Memcached的完全一致（抢生意真开心）。可以用来缓存html页面啊什么的。
   
   #+BEGIN_SRC shell
   > set mykey somevalue
   OK
   > get mykey
   "somevalue"
   #+END_SRC

   通过set和get可以分别对一个key的value进行设置和读取。value的大小也不能超过512MB。set的时候有额外参数。
   
   #+BEGIN_SRC shell
   > set mykey newval nx # 如果key已经存在则不set
   (nil)
   > set mykey newval xx # 只有key存在的时候才set
   OK
   #+END_SRC

*** incr incrby decr decrby

    #+BEGIN_SRC shell
    > set counter 100
    OK
    > incr counter
    (integer) 101
    > incrby counter 20
    (integer) 121
    #+END_SRC
   
    当然还有decr和decrby。这两种命令是不会有竞争现象的，就是说如果两个client当前某个key的value都是10，然后同时incr，那么redis会等到两个incr操作都执行完成以后才返回值，也就是12。

    mset, mget是multiple keys的操作，可以用来减少延迟。
   
    #+BEGIN_SRC shell
    > mset a 10 b 20 c 30
    Ok
    > mget a b c # mget会返回一个array
    "10"
    "20"
    "30"
    #+END_SRC
   
*** exsits and del and type
   
    #+BEGIN_SRC shell
    > set mykey hello
    OK
    > exsits mykey # 检查是否存在mykey
    (integer) 1
    > type mykey # 返回mykey value的类型
    string
    > del mykey # 删除mykey
    (integer) 1
    #+END_SRC
    
*** redis expires
    
    redis还有一个特性，就是可以设置数据的过期时间，时间一旦到达，则key会被自动删除。
    1. 自动删除时redis会在硬盘上保存key的删除时间。
    2. 过期时间默认单位是s

    #+BEGIN_SRC shell
    > set key somevalue
    OK
    > expire key 5
    (integer) 1
    > get key # 立刻
    "somevalue"
    > get key # 5s以后
    (nil)
    #+END_SRC

    #+BEGIN_SRC shell
    > set key 100 ex 10 # 可以在set的时候直接设置expire time
    Ok
    > ttl key # 查看total time left
    (integer) 9
    #+END_SRC
    
    还可以使用persist删除expire time的设置

** Redis Lists
   
   Redis Lists是linked list，并不是Array，所以就算你的list有很多很多元素，增加元素时用的时间也是一样的。这是优点。缺点是，通过index所以list里的一个元素比在array里要慢不少。如果想要通过index快速获取某一个element，建议使用sorted list这种类型。

*** lpush rpush
    分别是在左边和在右边增加一个element

    #+BEGIN_SRC shell
    > rpush mylist A
    (integer) 1
    > lpush mylist B
    (integer) 2
    > lrange mylist 0 -1 # 从0到最后个元素，即所有元素
    "B"
    "A"
    #+END_SRC

*** lpop rpop
    从左边或右边pop elements，例子就不举了

*** use of lists
    1. 记录最近一次的更新操作（数据的上一次变动可以放到list）
    2. 用于构建一个生产者消费者队列（如ruby的sidekiq）

    #+BEGIN_QUOTE
    队列的实现可以用lpush rpop，但会出现rpop时list当中没有值的情况，这种情况应该多等一会再重试rpop，可以直接使用brpop，比如brpop mylist 5, 就是如果mylist可以rpop就rpop，如果mylist为空就等待5s之后再rpop
    #+END_QUOTE

*** ltrim
    截取特定范围的lists，其余部分被remove
    
    #+BEGIN_SRC shell
    > rpush mylist 1 2 3 4 5
    (integer) 5
    > ltrim mylist 0 2
    OK
    > lrange mylist 0 -1
    "1"
    "2"
    "3"
    #+END_SRC
  
*** keys的自动创建与删除
    #+BEGIN_QUOTE
    目前redis中的key都不是单独创建和删除的，而是我们直接使用set lpush等赋值命令时自动创建，然后在value为空的时候自动删除的
    #+END_QUOTE

