blog/redis数据结构.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org22c35b6">1. Redis Keys</a></li>
<li><a href="#org7bff4ff">2. Redis Strings</a>
<ul>
<li><a href="#org4aed49c">2.1. incr incrby decr decrby</a></li>
<li><a href="#org2b8c5db">2.2. exsits and del and type</a></li>
<li><a href="#orgac40481">2.3. redis expires</a></li>
</ul>
</li>
<li><a href="#orgb869032">3. Redis Lists</a>
<ul>
<li><a href="#orgd50f032">3.1. lpush rpush</a></li>
<li><a href="#org346741a">3.2. lpop rpop</a></li>
<li><a href="#org1797243">3.3. use of lists</a></li>
<li><a href="#org7698ade">3.4. ltrim</a></li>
<li><a href="#org98f95d7">3.5. keys的自动创建与删除</a></li>
</ul>
</li>
<li><a href="#org96390bc">4. Redis Hashes</a>
<ul>
<li><a href="#org5b15864">4.1. hincrby</a></li>
</ul>
</li>
<li><a href="#orgf933268">5. Redis Sets</a></li>
<li><a href="#orgd476ee8">6. Redis Sorted Sets</a>
<ul>
<li><a href="#org01b30b5">6.1. operating on ranges</a></li>
</ul>
</li>
<li><a href="#orgf78ec1e">7. Bitmaps</a></li>
<li><a href="#org90df2a2">8. HyperlogLogs</a></li>
<li><a href="#org3ac9784">9. 总结使用场景</a></li>
</ul>
</div>
</div>
<p>
下面为redis支持的数据结构：
</p>
<ol class="org-ol">
<li>strings</li>
<li>lists: strings元素的集合，顺序为插入的顺序</li>
<li>sets: strings元素的集合，但唯一且没有顺序</li>
<li>sorted sets: 可排序的sets，根据'score'排序</li>
<li>hash: 和ruby的hash一样</li>
<li>bit数组: 暂时不知道</li>
<li>HyperLogLogs: &#x2026;</li>
</ol>

<div id="outline-container-org22c35b6" class="outline-2">
<h2 id="org22c35b6"><span class="section-number-2">1</span> Redis Keys</h2>
<div class="outline-text-2" id="text-1">
<p>
Redis Keys是binary safe的，所以可以使用任意二进制流，比如'foo'或者jpg图片，空字符串也是一种key。选择key需要注意以下几点：
</p>
<ol class="org-ol">
<li>不要使用太长的key，因为会影响查询速度；占用更多内存空间。</li>
<li>不要用太短的key，比如'user:1000:followers'非要写成'u:1000:flw'我的天，影响可读性。</li>
<li>key的名字尽量表示schema，比如'user:222'，多字符可以用'.'或者'-'来分割，比如'comment:123:reply-to'</li>
</ol>
<blockquote>
<p>
和SQL数据库相比，NoSQL数据库感觉就是把SQL的table和column按照特定规则组合成string，放到NoSQL的key中
</p>
</blockquote>
<ol class="org-ol">
<li>key size最大值为512MB</li>
</ol>
<blockquote>
<p>
鬼能超过-_-
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org7bff4ff" class="outline-2">
<h2 id="org7bff4ff"><span class="section-number-2">2</span> Redis Strings</h2>
<div class="outline-text-2" id="text-2">
<p>
Redis Strings的类型和Memcached的完全一致（抢生意真开心）。可以用来缓存html页面啊什么的。
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; set mykey somevalue
OK
&gt; get mykey
<span style="color: #CC9393;">"somevalue"</span>
</pre>
</div>

<p>
通过set和get可以分别对一个key的value进行设置和读取。value的大小也不能超过512MB。set的时候有额外参数。
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; set mykey newval nx <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">&#22914;&#26524;key&#24050;&#32463;&#23384;&#22312;&#21017;&#19981;set</span>
<span style="color: #DCDCCC;">(</span>nil<span style="color: #DCDCCC;">)</span>
&gt; set mykey newval xx <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">&#21482;&#26377;key&#23384;&#22312;&#30340;&#26102;&#20505;&#25165;set</span>
OK
</pre>
</div>
</div>

<div id="outline-container-org4aed49c" class="outline-3">
<h3 id="org4aed49c"><span class="section-number-3">2.1</span> incr incrby decr decrby</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-shell">&gt; set counter <span style="color: #BFEBBF;">100</span>
OK
&gt; incr counter
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">101</span>
&gt; incrby counter <span style="color: #BFEBBF;">20</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">121</span>
</pre>
</div>

<p>
当然还有decr和decrby。这两种命令是不会有竞争现象的，就是说如果两个client当前某个key的value都是10，然后同时incr，那么redis会等到两个incr操作都执行完成以后才返回值，也就是12。
</p>

<p>
mset, mget是multiple keys的操作，可以用来减少延迟。
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; mset a <span style="color: #BFEBBF;">10</span> b <span style="color: #BFEBBF;">20</span> c <span style="color: #BFEBBF;">30</span>
Ok
&gt; mget a b c <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">mget&#20250;&#36820;&#22238;&#19968;&#20010;array</span>
<span style="color: #CC9393;">"10"</span>
<span style="color: #CC9393;">"20"</span>
<span style="color: #CC9393;">"30"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b8c5db" class="outline-3">
<h3 id="org2b8c5db"><span class="section-number-3">2.2</span> exsits and del and type</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-shell">&gt; set mykey hello
OK
&gt; exsits mykey <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">&#26816;&#26597;&#26159;&#21542;&#23384;&#22312;mykey</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; type mykey <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">&#36820;&#22238;mykey value&#30340;&#31867;&#22411;</span>
string
&gt; del mykey <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">&#21024;&#38500;mykey</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac40481" class="outline-3">
<h3 id="orgac40481"><span class="section-number-3">2.3</span> redis expires</h3>
<div class="outline-text-3" id="text-2-3">
<p>
redis还有一个特性，就是可以设置数据的过期时间，时间一旦到达，则key会被自动删除。
</p>
<ol class="org-ol">
<li>自动删除时redis会在硬盘上保存key的删除时间。</li>
<li>过期时间默认单位是s</li>
</ol>

<div class="org-src-container">
<pre class="src src-shell">&gt; set key somevalue
OK
&gt; expire key <span style="color: #BFEBBF;">5</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; get key <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">&#31435;&#21051;</span>
<span style="color: #CC9393;">"somevalue"</span>
&gt; get key <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">5s&#20197;&#21518;</span>
<span style="color: #DCDCCC;">(</span>nil<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">&gt; set key <span style="color: #BFEBBF;">100</span> ex <span style="color: #BFEBBF;">10</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">&#21487;&#20197;&#22312;set&#30340;&#26102;&#20505;&#30452;&#25509;&#35774;&#32622;expire time</span>
Ok
&gt; ttl key <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">&#26597;&#30475;total time left</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">9</span>
</pre>
</div>

<p>
还可以使用persist删除expire time的设置
</p>
</div>
</div>
</div>

<div id="outline-container-orgb869032" class="outline-2">
<h2 id="orgb869032"><span class="section-number-2">3</span> Redis Lists</h2>
<div class="outline-text-2" id="text-3">
<p>
Redis Lists是linked list，并不是Array，所以就算你的list有很多很多元素，增加元素时用的时间也是一样的。这是优点。缺点是，通过index所以list里的一个元素比在array里要慢不少。如果想要通过index快速获取某一个element，建议使用sorted list这种类型。
</p>
</div>

<div id="outline-container-orgd50f032" class="outline-3">
<h3 id="orgd50f032"><span class="section-number-3">3.1</span> lpush rpush</h3>
<div class="outline-text-3" id="text-3-1">
<p>
分别是在左边和在右边增加一个element
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; rpush mylist A
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; lpush mylist B
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">2</span>
&gt; lrange mylist <span style="color: #BFEBBF;">0</span> -1 <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">&#20174;0&#21040;&#26368;&#21518;&#20010;&#20803;&#32032;&#65292;&#21363;&#25152;&#26377;&#20803;&#32032;</span>
<span style="color: #CC9393;">"B"</span>
<span style="color: #CC9393;">"A"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org346741a" class="outline-3">
<h3 id="org346741a"><span class="section-number-3">3.2</span> lpop rpop</h3>
<div class="outline-text-3" id="text-3-2">
<p>
从左边或右边pop elements，例子就不举了
</p>
</div>
</div>

<div id="outline-container-org1797243" class="outline-3">
<h3 id="org1797243"><span class="section-number-3">3.3</span> use of lists</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>记录最近一次的更新操作（数据的上一次变动可以放到list）</li>
<li>用于构建一个生产者消费者队列（如ruby的sidekiq）</li>
</ol>

<blockquote>
<p>
队列的实现可以用lpush rpop，但会出现rpop时list当中没有值的情况，这种情况应该多等一会再重试rpop，可以直接使用brpop，比如brpop mylist 5, 就是如果mylist可以rpop就rpop，如果mylist为空就等待5s之后再rpop
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org7698ade" class="outline-3">
<h3 id="org7698ade"><span class="section-number-3">3.4</span> ltrim</h3>
<div class="outline-text-3" id="text-3-4">
<p>
截取特定范围的lists，其余部分被remove
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; rpush mylist <span style="color: #BFEBBF;">1</span> <span style="color: #BFEBBF;">2</span> <span style="color: #BFEBBF;">3</span> <span style="color: #BFEBBF;">4</span> <span style="color: #BFEBBF;">5</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">5</span>
&gt; ltrim mylist <span style="color: #BFEBBF;">0</span> <span style="color: #BFEBBF;">2</span>
OK
&gt; lrange mylist <span style="color: #BFEBBF;">0</span> -1
<span style="color: #CC9393;">"1"</span>
<span style="color: #CC9393;">"2"</span>
<span style="color: #CC9393;">"3"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org98f95d7" class="outline-3">
<h3 id="org98f95d7"><span class="section-number-3">3.5</span> keys的自动创建与删除</h3>
<div class="outline-text-3" id="text-3-5">
<blockquote>
<p>
目前redis中的key都不是单独创建和删除的，而是我们直接使用set lpush等赋值命令时自动创建，然后在value为空的时候自动删除的
</p>
</blockquote>
</div>
</div>
</div>
