src/redis数据结构.org
** Redis Hashes

   redis的hash就是我们熟悉的hash
   
   #+BEGIN_SRC shell
   > hmset user:1000 username antirez birthyear 1977 verified 1
   OK
   > hget user:1000 username
   "antirez"
   > hget user:1000 birthyear
   "1977"
   > hgetall user:1000
   "username"
   "antirez"
   "birthyear"
   "1977"
   "verified"
   "1"
   #+END_SRC
   
   hash的value没有明确的大小限制，hmset是给multiple fields赋值，hmget返回的是一个数组，此处不再举例
   
*** hincrby
    
    和incrby类似，不过是用在hash上的而已
    
    #+BEGIN_SRC shell
    > hincrby user:1000 birthyear 10
    (integer) 1987
    > hincrby user:1000 birthyear 10
    (integer) 1997
    #+END_SRC
    
    #+BEGIN_QUOTE
    hashes是通过一种特殊方式编码的，可以让内存读取更有效率
    #+END_QUOTE

** Redis Sets

   Redis Sets是无序的字符串的集合
   #+BEGIN_QUOTE
   和list有什么区别？
   #+END_QUOTE
   
   #+BEGIN_SRC shell
   > sadd myset 1 2 3
   (integer) 3
   > smembers myset # set是没有任何order的
   1. 3
   2. 1
   3. 2
   #+END_SRC
   
   可以通过sismember来确定set里面有没有特定元素

   #+BEGIN_SRC shell
   > sismember myset 3
   (integer) 1
   > sismember myset 20
   (integer) 0
   #+END_SRC
   
   sets可以用来表示model之间的relation

   #+BEGIN_SRC shell
   > sadd news:1000:tags 1 2 5 77
   (integer) 4
   #+END_SRC

   总之set有很多配套的方法，包括scard 可以返回set里面元素的个数，srandmember可以随机化所有的elements等

** Redis Sorted Sets
   
   Sorted Sets某种意义上就是sets，但它也可以说是sets和hash的混合体，所有的element都被绑定了一个point value，叫做score（所以说像hash），elements是经过排序的，排序的规则如下：
   1. 如果A.score > B.score，则A > B
   2. 如果A.score = B.score，但A的字母顺序比B大，则A > B
   3. 总之A和B不可能相同，因为sorted sets的element都是唯一的

   #+BEGIN_SRC shell
   > zadd hackers 1940 "Alan Kay"
   (integer) 1
   > zadd hackers 1957 "Sophie Wilson"
   (integer) 1
   > zadd hackers 1953 "Richard Stallman"
   (integer) 1
   > zadd hackers 1949 "Anita Borg"
   (integer) 1
   > zadd hackers 1965 "Yukihiro Matsumoto"
   (integer) 1
   > zadd hackers 1914 "Hedy Lamarr"
   (integer) 1
   > zadd hackers 1916 "Claude Shannon"
   (integer) 1
   > zadd hackers 1969 "Linus Torvalds"
   (integer) 1
   > zadd hackers 1912 "Alan Turing"
   (integer) 1
   #+END_SRC

   zadd比sadd多了一个score参数
   
   #+BEGIN_SRC shell
   > zrange hackers 0 -1
   1) "Alan Turing"
   2) "Hedy Lamarr"
   3) "Claude Shannon"
   4) "Alan Kay"
   5) "Anita Borg"
   6) "Richard Stallman"
   7) "Sophie Wilson"
   8) "Yukihiro Matsumoto"
   9) "Linus Torvalds"
   #+END_SRC
   
   排序是按照score来的

*** operating on ranges
    sorted sets强大的地方是可以根据score的range进行操作，比如找到1950年之后出生的人

    #+BEGIN_SRC shell
    > zrangebyscore hackers -inf 1950
    1) "Alan Turing"
    2) "Hedy Lamarr"
    3) "Claude Shannon"
    4) "Alan Kay"
    5) "Anita Borg"
    #+END_SRC

    或者是remove 1940到1960之间出生的人
    #+BEGIN_SRC shell
    > zremrangebyscore hackers 1940 1960
    (integer) 4 
    #+END_SRC

    从这个角度看，sorted sets真的就是一个hash，只不过hash的key是数字，且集成了一些固有的好用的方法

    还有一个zrank可以返回value对应的位置

    #+BEGIN_SRC shell
    > zrank hackers "Anita Borg"
    (integer) 4
    #+END_SRC

    sorted sets还可以通过首字母的顺序进行一些操作，这里不再赘述，可以查看相关资料。

    #+BEGIN_QUOTE
    sorted sets的一大优势：zadd只是O(log(N))的时间复杂度，所以如果有大量的updates，可以使用sorted sets
    #+END_QUOTE
    
** Bitmaps
   
   bitmaps并不是一种单独的数据类型，而是基于string类型的，因为string类型的最大空间是512MB，所以可以设置最多2^32不同的bits

   #+BEGIN_QUOTE
   bitmaps的最大优点就是节约空间
   #+END_QUOTE

   #+BEGIN_SRC shell
   > setbit key 10 1 # 10是bit number，1是bit value
   (integer) 1
   > getbit key 10
   (integer) 1
   #+END_SRC
   
   #+BEGIN_QUOTE
   bitmaps一般用来储存boolean的字段
   #+END_QUOTE

