blog/redis数据结构.html

<div id="outline-container-org96390bc" class="outline-2">
<h2 id="org96390bc"><span class="section-number-2">4</span> Redis Hashes</h2>
<div class="outline-text-2" id="text-4">
<p>
redis的hash就是我们熟悉的hash
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; hmset user:1000 username antirez birthyear <span style="color: #BFEBBF;">1977</span> verified <span style="color: #BFEBBF;">1</span>
OK
&gt; hget user:1000 username
<span style="color: #CC9393;">"antirez"</span>
&gt; hget user:1000 birthyear
<span style="color: #CC9393;">"1977"</span>
&gt; hgetall user:1000
<span style="color: #CC9393;">"username"</span>
<span style="color: #CC9393;">"antirez"</span>
<span style="color: #CC9393;">"birthyear"</span>
<span style="color: #CC9393;">"1977"</span>
<span style="color: #CC9393;">"verified"</span>
<span style="color: #CC9393;">"1"</span>
</pre>
</div>

<p>
hash的value没有明确的大小限制，hmset是给multiple fields赋值，hmget返回的是一个数组，此处不再举例
</p>
</div>

<div id="outline-container-org5b15864" class="outline-3">
<h3 id="org5b15864"><span class="section-number-3">4.1</span> hincrby</h3>
<div class="outline-text-3" id="text-4-1">
<p>
和incrby类似，不过是用在hash上的而已
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; hincrby user:1000 birthyear <span style="color: #BFEBBF;">10</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1987</span>
&gt; hincrby user:1000 birthyear <span style="color: #BFEBBF;">10</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1997</span>
</pre>
</div>

<blockquote>
<p>
hashes是通过一种特殊方式编码的，可以让内存读取更有效率
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgf933268" class="outline-2">
<h2 id="orgf933268"><span class="section-number-2">5</span> Redis Sets</h2>
<div class="outline-text-2" id="text-5">
<p>
Redis Sets是无序的字符串的集合
</p>
<blockquote>
<p>
和list有什么区别？
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-shell">&gt; sadd myset <span style="color: #BFEBBF;">1</span> <span style="color: #BFEBBF;">2</span> <span style="color: #BFEBBF;">3</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">3</span>
&gt; smembers myset <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">set&#26159;&#27809;&#26377;&#20219;&#20309;order&#30340;</span>
<span style="color: #BFEBBF;">1.</span> <span style="color: #BFEBBF;">3</span>
<span style="color: #BFEBBF;">2.</span> <span style="color: #BFEBBF;">1</span>
<span style="color: #BFEBBF;">3.</span> <span style="color: #BFEBBF;">2</span>
</pre>
</div>

<p>
可以通过sismember来确定set里面有没有特定元素
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; sismember myset <span style="color: #BFEBBF;">3</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; sismember myset <span style="color: #BFEBBF;">20</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">0</span>
</pre>
</div>

<p>
sets可以用来表示model之间的relation
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; sadd news:1000:tags <span style="color: #BFEBBF;">1</span> <span style="color: #BFEBBF;">2</span> <span style="color: #BFEBBF;">5</span> <span style="color: #BFEBBF;">77</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">4</span>
</pre>
</div>

<p>
总之set有很多配套的方法，包括scard 可以返回set里面元素的个数，srandmember可以随机化所有的elements等
</p>
</div>
</div>

<div id="outline-container-orgd476ee8" class="outline-2">
<h2 id="orgd476ee8"><span class="section-number-2">6</span> Redis Sorted Sets</h2>
<div class="outline-text-2" id="text-6">
<p>
Sorted Sets某种意义上就是sets，但它也可以说是sets和hash的混合体，所有的element都被绑定了一个point value，叫做score（所以说像hash），elements是经过排序的，排序的规则如下：
</p>
<ol class="org-ol">
<li>如果A.score &gt; B.score，则A &gt; B</li>
<li>如果A.score = B.score，但A的字母顺序比B大，则A &gt; B</li>
<li>总之A和B不可能相同，因为sorted sets的element都是唯一的</li>
</ol>

<div class="org-src-container">
<pre class="src src-shell">&gt; zadd hackers <span style="color: #BFEBBF;">1940</span> <span style="color: #CC9393;">"Alan Kay"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; zadd hackers <span style="color: #BFEBBF;">1957</span> <span style="color: #CC9393;">"Sophie Wilson"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; zadd hackers <span style="color: #BFEBBF;">1953</span> <span style="color: #CC9393;">"Richard Stallman"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; zadd hackers <span style="color: #BFEBBF;">1949</span> <span style="color: #CC9393;">"Anita Borg"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; zadd hackers <span style="color: #BFEBBF;">1965</span> <span style="color: #CC9393;">"Yukihiro Matsumoto"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; zadd hackers <span style="color: #BFEBBF;">1914</span> <span style="color: #CC9393;">"Hedy Lamarr"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; zadd hackers <span style="color: #BFEBBF;">1916</span> <span style="color: #CC9393;">"Claude Shannon"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; zadd hackers <span style="color: #BFEBBF;">1969</span> <span style="color: #CC9393;">"Linus Torvalds"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; zadd hackers <span style="color: #BFEBBF;">1912</span> <span style="color: #CC9393;">"Alan Turing"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
</pre>
</div>

<p>
zadd比sadd多了一个score参数
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; zrange hackers <span style="color: #BFEBBF;">0</span> -1
<span style="color: #BFEBBF;">1</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Alan Turing"</span>
<span style="color: #BFEBBF;">2</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Hedy Lamarr"</span>
<span style="color: #BFEBBF;">3</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Claude Shannon"</span>
<span style="color: #BFEBBF;">4</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Alan Kay"</span>
<span style="color: #BFEBBF;">5</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Anita Borg"</span>
<span style="color: #BFEBBF;">6</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Richard Stallman"</span>
<span style="color: #BFEBBF;">7</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Sophie Wilson"</span>
<span style="color: #BFEBBF;">8</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Yukihiro Matsumoto"</span>
<span style="color: #BFEBBF;">9</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Linus Torvalds"</span>
</pre>
</div>

<p>
排序是按照score来的
</p>
</div>

<div id="outline-container-org01b30b5" class="outline-3">
<h3 id="org01b30b5"><span class="section-number-3">6.1</span> operating on ranges</h3>
<div class="outline-text-3" id="text-6-1">
<p>
sorted sets强大的地方是可以根据score的range进行操作，比如找到1950年之后出生的人
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; zrangebyscore hackers -inf <span style="color: #BFEBBF;">1950</span>
<span style="color: #BFEBBF;">1</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Alan Turing"</span>
<span style="color: #BFEBBF;">2</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Hedy Lamarr"</span>
<span style="color: #BFEBBF;">3</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Claude Shannon"</span>
<span style="color: #BFEBBF;">4</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Alan Kay"</span>
<span style="color: #BFEBBF;">5</span><span style="color: #88090B;">)</span> <span style="color: #CC9393;">"Anita Borg"</span>
</pre>
</div>

<p>
或者是remove 1940到1960之间出生的人
</p>
<div class="org-src-container">
<pre class="src src-shell">&gt; zremrangebyscore hackers <span style="color: #BFEBBF;">1940</span> <span style="color: #BFEBBF;">1960</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">4</span> 
</pre>
</div>

<p>
从这个角度看，sorted sets真的就是一个hash，只不过hash的key是数字，且集成了一些固有的好用的方法
</p>

<p>
还有一个zrank可以返回value对应的位置
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; zrank hackers <span style="color: #CC9393;">"Anita Borg"</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">4</span>
</pre>
</div>

<p>
sorted sets还可以通过首字母的顺序进行一些操作，这里不再赘述，可以查看相关资料。
</p>

<blockquote>
<p>
sorted sets的一大优势：zadd只是O(log(N))的时间复杂度，所以如果有大量的updates，可以使用sorted sets
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgf78ec1e" class="outline-2">
<h2 id="orgf78ec1e"><span class="section-number-2">7</span> Bitmaps</h2>
<div class="outline-text-2" id="text-7">
<p>
bitmaps并不是一种单独的数据类型，而是基于string类型的，因为string类型的最大空间是512MB，所以可以设置最多2<sup>32不同的bits</sup>
</p>

<blockquote>
<p>
bitmaps的最大优点就是节约空间
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-shell">&gt; setbit key <span style="color: #BFEBBF;">10</span> <span style="color: #BFEBBF;">1</span> <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F; font-style: italic;">10&#26159;bit number&#65292;1&#26159;bit value</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; getbit key <span style="color: #BFEBBF;">10</span>
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
</pre>
</div>

<blockquote>
<p>
bitmaps一般用来储存boolean的字段
</p>
</blockquote>
</div>
</div>
