src/redis数据结构.org
** HyperlogLogs
   
   hll数据类型主要是用于计算唯一元素的数量。一般计算唯一元素数量要占用很大的内存，内存的使用和items的数量相关，但hll使用了独特的算法，使得内存的占用数量一定

   #+BEGIN_SRC shell
   > pfadd hll a b c
   (integer) 1
   > pfcount hll
   (integer) 4
   #+END_SRC
   
   pfadd实际并没有把items加入hll，hll数据类型只是包含了一种状态而非真正的元素

   #+BEGIN_QUOTE
   应该只有在数据量相当大的时候才会用到这个吧
   #+END_QUOTE
   
** 总结使用场景
   1. string 保存一个简单的值
   2. list 生产者消费者队列，或保存更新的log
   3. hash 保存对象类似的结构
   4. sets 保存model之间的relation关系
   5. sorted sets 大量的updates，或者根据score的元素操作
   6. bitmaps boolean类型，节省内存空间的需求
   7. hyperloglogs 大量数据计算总个数，对内存占用有很高要求
