blog/redis数据结构.html

<div id="outline-container-org90df2a2" class="outline-2">
<h2 id="org90df2a2"><span class="section-number-2">8</span> HyperlogLogs</h2>
<div class="outline-text-2" id="text-8">
<p>
hll数据类型主要是用于计算唯一元素的数量。一般计算唯一元素数量要占用很大的内存，内存的使用和items的数量相关，但hll使用了独特的算法，使得内存的占用数量一定
</p>

<div class="org-src-container">
<pre class="src src-shell">&gt; pfadd hll a b c
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">1</span>
&gt; pfcount hll
<span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; font-weight: bold;">integer</span><span style="color: #DCDCCC;">)</span> <span style="color: #BFEBBF;">4</span>
</pre>
</div>

<p>
pfadd实际并没有把items加入hll，hll数据类型只是包含了一种状态而非真正的元素
</p>

<blockquote>
<p>
应该只有在数据量相当大的时候才会用到这个吧
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org3ac9784" class="outline-2">
<h2 id="org3ac9784"><span class="section-number-2">9</span> 总结使用场景</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>string 保存一个简单的值</li>
<li>list 生产者消费者队列，或保存更新的log</li>
<li>hash 保存对象类似的结构</li>
<li>sets 保存model之间的relation关系</li>
<li>sorted sets 大量的updates，或者根据score的元素操作</li>
<li>bitmaps boolean类型，节省内存空间的需求</li>
<li>hyperloglogs 大量数据计算总个数，对内存占用有很高要求</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.3.1)</p>
</div>
</div>
</body>
</html>
